// 1. 自动存储    2. 静态存储    3. 动态存储    4. 线程存储
//16. C++一共有四种存储方式:
//	16.1 自动存储   (栈中保存)
//		16.1.1 函数内部定义的常规变量;
//		16.1.2 函数被调用的时候产生, 函数结束时消亡;
//		16.1.3 自动变量是一个局部变量, 存储在栈中;
//	16.2 静态存储   (不在栈中, 不在堆中)
//		16.2.1 定义方式有两种: 1. 函数外部定义; 2. 函数内部定义的时候加上static关键字;
//		16.2.2 存在于程序的整个生命周期;
//	16.3 动态存储   (堆中保存)
//		16.3.1 使用new和delete分配内存;
//		16.3.2 堆和用于保存静态变量和自动变量的内存是分开的;
//		16.3.3 在new语句开始生命周期, 在delete结束生命周期;
#include <iostream>
using namespace std;

int 静态 = 1;

int main(void)
{
	int 自动 = 2;
	int * p动态 = new int;
	*p动态 = 3;

	cout << &静态 << endl;
	static int 静态2 = 1;
	cout << (int*)"daxionggege" << endl;
	cout << &自动 << endl;
	cout << p动态 << endl;
	

	return 0;
}